#include <stdio.h>
#include <windows.h>

// 1. 시작과 끝
// 
// 스토리 라인을 세워서 시작과 끝을 정한다.
// hp <= 0 / 보스를 잡을시 게임 종료
// 
// 
// 2. 게임에서 필요한 기능
// 
// 첫 화면 메뉴생성(게임시작, 불러오기, 종료)
// - 불러오기의 경우 파일 쓰기 / 읽기(? )를 통하면 될수도.. ? (모르겠다.)
// 
// 1. 게임시작
// 주인공 이름 입력받기
// 스토리 진행
// 무기 선택(무기별 속성 값 설정)
// 몬스터 등장(몬스터 체력, 방어력, 공격력 설정)
// 
// 레벨과 경험치 설정, 레벨에 따른 스탯 설정 ?
// 
// 2. 불러오기
// 파일 읽기 / 쓰기를 통해 불러오기가 가능하도록 설정
// 
// 3. hp <= 0 일 경우와 보스 몬스터가 쓰러질 경우 게임이 끝나도록 설정
// 
// 
// 3. 필요한 기능을 추상화.
// 
// 4. 코드로 옮기기.

#define HEIGHT 9
#define WIDTH 38

#define UP 0
#define DOWN 1
#define LEFT 2
#define RIGHT 3
#define SUBMIT 4

void title()
{
	const char title[HEIGHT][WIDTH] =
	{
		{ '2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2' },
		{ '0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0' },
		{ '0','0','1','1','1','0','1','1','1','0','1','0','1','0','1','1','1','0','0','0','0','0','1','1','1','0','0','1','1','1','0','0','0','1','1','0','0','0' },
		{ '0','0','0','1','0','0','1','0','0','0','1','0','1','0','0','1','0','0','0','0','0','0','1','0','0','1','0','1','0','0','1','0','1','0','0','1','0','0' },
		{ '0','0','0','1','0','0','1','1','1','0','0','1','0','0','0','1','0','0','1','1','1','0','1','1','1','0','0','1','1','1','0','0','1','0','0','0','0','0' },
		{ '0','0','0','1','0','0','1','0','0','0','1','0','1','0','0','1','0','0','0','0','0','0','1','0','0','1','0','1','0','0','0','0','1','0','1','1','0','0' },
		{ '0','0','0','1','0','0','1','1','1','0','1','0','1','0','0','1','0','0','0','0','0','0','1','0','0','1','0','1','0','0','0','0','0','1','1','0','0','0' },
		{ '0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0' },
		{ '2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2','2' }
	};

	for (int i = 0; i < HEIGHT; i++)
	{
		for (int j = 0; j < WIDTH; j++)
		{
			if (title[i][j] == '1')
			{
				printf("■");
			}
			else if (title[i][j] == '0')
			{
				printf("  ");
			}
			else
			{
				printf("〓");
			}
		}

		printf("\n");
	}
}

void gotoxy(int x, int y)
{
	HANDLE consoleHandle = GetStdHandle(STD_OUTPUT_HANDLE);
	COORD pos;
	pos.X = x;
	pos.Y = y;
	SetConsoleCursorPosition(consoleHandle, pos);
}

int menu()
{
	int x = 32;
	int y = 14;

	gotoxy(x-2, y);
	printf("> 게 임 시 작");
	gotoxy(x, y+2);
	printf("불 러 오 기");
	gotoxy(x, y+4);
	printf("   종 료   ");

	while (1)
	{
		int n = keyControl();
		    switch (n)
		    {
		    case UP: {
		    	if (y > 14)
		    	{
		    		gotoxy(x-2, y);
		    		printf(" ");
		    		gotoxy(x-2, y-=2);
		    		printf(">");
		    	}
		    	break;
		    }
		    
		    case DOWN: {
		    	if (y < 14)
		    	{
		    		gotoxy(x-2, y);
		    		printf(" ");
		    		gotoxy(x-2, y+=2);
		    		printf(">");
		    	}
		    	break;
		    }
		    
		    case SUBMIT: {
		    	return y-14;
		    }
		}
	}
}


int main()
{
	system("mode con cols=76 lines=26");

	title();
	int menuCode = menu();

	return 0;
}

int keyControl()
{
	char temp = getch();

	if (temp == 'w' || temp == 'W')
	{
		return UP;
	}
	else if (temp == 'a' || temp == 'A')
	{
		return LEFT;
	}
	else if (temp == 's' || temp == 'S')
	{
		return DOWN;
	}
	else if (temp == 'd' || temp == 'D')
	{
		return RIGHT;
	}
	else if (temp == ' ')
	{
		return SUBMIT;
	}
}